app/controllers/news_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
  	@data = Article.all ;

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "votes" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["votes", 2], ["updated_at", "2017-10-10 14:54:17.121896"], ["id", 1]]
---
  def vote
  	@id = params[:id] ;
  	@x = Article.find(params[:id]) ;
  	@x.votes+=1 ;
  	@x.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "votes" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["votes", 24], ["updated_at", "2017-10-10 19:11:40.392347"], ["id", 4]]
---
  def devote
  	@id = params[:id] ;
  	@x = Article.find(params[:id]) ;
  	@x.votes-=1 ;
  	@x.save